Revit 2024 API
BuiltInFailures.RebarSystemFailures.CannotPlaceAreaReininforcement Property
 Can't find a host for Area Reinforcement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotPlaceAreaReininforcement { get; }
Visual Basic
Public Shared ReadOnly Property CannotPlaceAreaReininforcement As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotPlaceAreaReininforcement {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace